import React from "react";
import HistoryParagraph from "./history-paragraph-item/history-paragraph-item.component";
import PageTitle from "../../components/page-title/page-title.component";
import { Link } from "react-router-dom";

import "./history.styles.scss";

class History extends React.Component {
  constructor() {
    super();

    this.state = {
      pageTitle: "היסטוריה",

      paragraphs: [
        {
          id: 1,
          title: " עליה לארץ ישראל ",
          text: ` בשנת 1909 עלו ממחוז שרעב שבתימן מספר משפחות ובראשן הרב דוד ישראל צאירי, בתקופה בה האימפריה
                    העות'מאנית עדיין שלטה הן בתימן והן בארץ ישראל. בתחילה נעו התימנים ברגל במשך שלושה שבועות עד
                    שהגיעו לעיר עדן, משם המשיכו בהפלגה לסואץ וחיפה. לאחר זמן קצר עברו לחדרה לאחר שקיבלו הצעה
                    לעבודה. בחדרה חיו התימנים בתנאי דוחק קשים ביותר עד שנת 1912, אז הציע להם נציג מאגודת "השומר" לעבור
                    ולהתיישב בגליל, הצעה לה נעתרו התימנים.`,
          qoute: `ידידי, זו הארץ שלכם, שלכם ושל אבותיכם, אבל לא שלי; אני-שלי ארץ ישראל, רחוק בפלסטין, שם הארץ שלי
                    ושל אבותי.`
        },
        {
          id: 2,
          title: `
            התיישבות בכנרת
            `,
          text: `
          כאשר הגיעו לכנרת, החליטו חלק מהתימנים להמשיך לעבר יבנאל, והשאר, כ-14 משפחות, החליטו להישאר
           במקום. בכנרת הוקצה לתימנים מבנה אחד בלבד, "בית המוטור", אשר הוקם בשנת 1910 ושימש לשאיבת מים מהירדן לצרכי
          השקיה. בבית המוטור אשר שימש לשאיבת מים מהירדן לצרכי השקיה היו שלושה חדרים בלבד, בהם התגוררו הרב ושתי
          משפחות נוספות. שאר משפחות התימנים התגוררו במבני טיט אותם הם בנו בעצמם.
          `,
          qoute: `
          גם בלילה לא אנוח כי קול המכונה מנודדת שנתי מעיני...
         `
        },
        {
          id: 3,
          title: `
          חלוצים
          `,
          text: `
          סדר יומם של התימנים החל בתפילה בבוקר אשר בסיומה יצאו לעבודה שכללה ייבוש הביצות, עקירת עצי
          שיזף, נטיעת אקליפטוסים ליבוש הביצות, הכשרת הקרקע לחקלאות וגידול משק חי וצומח. כמו כן, עסקו בעבודה
          שכירה ובקבלנות בחוות כנרת, בביתניה, בדגניה ובכנרת המושבה, ואף בעבודות תשתית לתחנת החשמל בנהריים ובסלילת
          כבישים באזור. המתיישבים סבלו ממחלות קשות, מקדחת ומתמותה רבה ומתוך המשפחות שהגיעו לכנרת נותרו רק עשר
          משפחות, אשר אף הן איבדו רבים מיקיריהן.
      `,
          qoute: `
          אנחנו תימני כנרת נודיע לכם כי כאשר הגענו לכנרת אפילו עץ אחד לא היה...
          `
        },
        {
          id: 4,
          title: `
          חיכוך ומאבק
          `,
          text: `
          בשנת תרע"ד (1915) נעשה נסיון ראשון להקים את קבוצת כנרת בסמוך למושבם של "תימני כנרת"; בפועל,
          הקבוצה עלתה על הקרקע רק בשנות ה-20. הקרבה הפיזית הביאה לחיכוכים בין שתי קבוצות המתיישבים. באותה שנה
          נבנו לתימנים חמישה בתים נוספים אשר הספיקו רק לחלק נוסף מהמשפחות ולא לכולן. בנוסף, הייתה כוונה לצרף למושב
          מספר פועלים אשכנזים על מנת להדריך ולסייע לתימנים. למרות כל זאת, קבוצת כנרת הערימה קשיים על "תימני כנרת" בדרכים שונות: הקבוצה התנגדה ומנעה בניית בתים נוספים לתימנים; עודדה את העברת המתיישבים ממקומם בטענה שאין מספיק "מרחב מחיה" לשתי קבוצות; לא
          סייעו בחריש האדמה; מנעו מים לשתיה והשקיה.
            `,
          qoute: `
          מתוך השקפה אובייקטיבית אכזרית- צריכים התימנים ללכת, ובעיניהם דומה הדבר לגזילה. הרי הם יושבים כאן
          15 שנה. פה מתו הוריהם, נשיהם, ילדיהם. והקבוצה... ברובה המכריע רק לפני שלוש שנים באו אל הארץ...
            `
        },
        {
          id: 5,
          title: `
          עקירה לרחובות
          `,
          text: `
          לבסוף, בשנת 1930, הועברו התימנים לרחובות. על כך אמר יוסף מרגלית מתימני כנרת: "אנחנו למעשה
          לא רצינו לעבור, הרבה זמן הם רצו שאנחנו נעבור, ואנחנו לא רצינו. הדבר היחיד שגרם לנו לעבור - זה היה
          חוסר המניין בבית הכנסת... בתימן לא היתה לי גלות. הגלות היא בארץ ישראל. אם בשבת אני לא יכול
          להתפלל בציבור זו גלות. אני לא יכול להישאר פה. ואנחנו הרבה שנים דרשנו מקק"ל שיביאו עוד משפחות, אבל הם לא רק שלא רצו
          להביא עוד משפחות אלא רצו את המשפחות שלנו להעביר למקום אחר."
          כך, לאחר כ - 19 שנה הועברו "תימני כנרת"
          ממקום מושבם וייסדו את מושב העובדים הראשון של בני העדה התימנית - מרמורק. 
          `,
          qoute: `
          בתימן לא היתה לי גלות. הגלות היא בארץ ישראל...
          `
        }
      ]
    };
  }

  render() {
    return (
      <div className="history p-2">
        <PageTitle title={this.state.pageTitle} />

        <div className="text-center mb-3">
          <Link to="/articles/2">
            מבוסס על
            <b>
              {` `}
              התנהגות פוליטית בישראל, סיפורם של "תימני כנרת" פונקציונליזם חברתי
              או קולוניאליזם אשכנזי?
            </b>
          </Link>
        </div>

        {this.state.paragraphs.map(({ id, ...otherProps }) => (
          <HistoryParagraph key={id} {...otherProps} />
        ))}
        <p className="mt-md-4 font-weight-bold" id="clarification">
          *הבהרה! לאחר העשור הראשון המתיישבים התימנים הצליחו לשפר את תנאי החיים
          במקום- התמותה והמחלות פחתו/פסקו, האדמה עובדה ותוצרת חקלאית אף נשלחה
          להימכר בדמשק. כלומר, מעבר לקשיים חשוב להדגיש שההתיישבות התימנית בכנרת
          הצליחה במשימתה החלוצית.
        </p>
      </div>
    );
  }
}

export default History;
